app/Http/Controllers/DemandeursController.php

select * from `demandeurs` where `demandeurs`.`deleted_at` is null
---
    public function index()
    {

      /*   $date = Carbon::today()->toDateString();
        dd($date); */

        $user_role  =   Auth::user()->role->name;

        $demandeurs = Demandeur::with('user.demandeur.modules','user.demandeur.localite')->get();