app/Http/Controllers/DirectionsController.php

select * from `courriers` where `courriers`.`deleted_at` is null
select * from `directions` where `directions`.`deleted_at` is null
---
    public function index()
    {
        $chart      = \App\Courrier::all();
        $chart = new Courrierchart;
        $chart->labels(['', '', '']);
        $chart->dataset('STATISTIQUES', 'bar', ['','',''])->options([
            'backgroundColor'=>["#3e95cd", "#8e5ea2","#3cba9f"],
        ]);

       $directions = \App\Direction::all();