app/Http/Controllers/EmployeesController.php

    public function list(Request $request)
    {
        $employees=Employee::with('user.employee.fonction')->get();
---
select * from `employees` where `employees`.`deleted_at` is null
select * from `fonctions` where `fonctions`.`id` in (7, 9, 13, 15, 17, 18, 20, 22, 26, 27, 30, 31, 36) and `fonctions`.`deleted_at` is null
select * from `users` where `users`.`id` in (63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77) and `users`.`deleted_at` is null