app/Http/Controllers/HomeController.php

select * from `courriers` where `courriers`.`deleted_at` is null
---
    public function index()
    {

        $recues = \App\Recue::get()->count();
        $internes = \App\Interne::get()->count();
        $departs = \App\Depart::get()->count();
        $courriers = \App\Courrier::get()->count();
        $demandeurs = \App\Demandeur::get()->count();
        $operateurs = \App\Operateur::get()->count();
        $Personnels = \App\Personnel::get()->count();
        $chart      = \App\Courrier::all();