app/Http/Controllers/IndividuellesController.php

select * from `individuelles` where `individuelles`.`deleted_at` is null
select `nom`, `id` from `regions`
---
    public function index()
    {
        $individuelles = Individuelle::all();

        //dd($individuelles);
        $countries = DB::table('regions')->pluck("nom","id");

select distinct * from `users` where `users`.`deleted_at` is null
select distinct * from `modules` where `modules`.`deleted_at` is null
select distinct * from `programmes` where `programmes`.`deleted_at` is null
select distinct * from `diplomes` where `diplomes`.`deleted_at` is null
select distinct * from `departements` where `departements`.`deleted_at` is null
select distinct * from `regions` where `regions`.`deleted_at` is null
select * from `regions` where `regions`.`deleted_at` is null
---
    public function create()
    {
        $civilites = User::distinct('civilite')->get()->pluck('civilite','civilite')->unique();
        $modules = Module::distinct('name')->get()->pluck('name','id')->unique();
        $programmes = Programme::distinct('name')->get()->pluck('sigle','id')->unique();
        $diplomes = Diplome::distinct('name')->get()->pluck('name','id')->unique();
        $departements = Departement::distinct('nom')->get()->pluck('nom','id')->unique();
        $regions = Region::distinct('nom')->get()->pluck('nom','id')->unique();
        $prod = Region::all();

select `nom`, `id` from `departements` where `regions_id` = 'create'
---
    public function findProductName(Request $request){


	    //if our chosen id and products table prod_cat_id col match the get first 100 data

        //$request->id here is the id of our chosen option id
        $data=Departement::select('nom','id')->where('regions_id',$request->id)->take(100)->get();