app/Http/Controllers/ModulesController.php

select * from `modules` where `modules`.`deleted_at` is null
---
    public function index()
    {
        $modules = Module::get();

insert into `modules` (`name`, `domaines_id`, `uuid`, `updated_at`, `created_at`) values ('Espagnol', '21', '3d1f65a5-2f6c-4ea9-9b88-5a497679c0eb', '2021-06-22 16:37:16', '2021-06-22 16:37:16')
---
    public function store(Request $request)
    {
        $this->validate(
            $request, [

                'module'      =>  'required|string|max:50|unique:modules,name',
                'domaine'      =>  'required|string'
            ]
        );
        $domaine_id = $request->input('domaine');

       /*  dd($domaine_id); */
        $domaine = new Module([
            'name'           =>      $request->input('module'),
            'domaines_id'    =>      $domaine_id

        ]);

        $domaine->save();

update `modules` set `deleted_at` = '2021-06-22 16:35:17', `modules`.`updated_at` = '2021-06-22 16:35:17' where `id` = 1
---
    public function destroy(Module $module)
    {
        $module->delete();

select * from `domaines` where `domaines`.`id` in (1, 9, 33, 34) and `domaines`.`deleted_at` is null
select * from `modules` where `modules`.`deleted_at` is null
select * from `secteurs` where `secteurs`.`id` in (1, 2, 3) and `secteurs`.`deleted_at` is null
select `demandeurs`.*, `demandeurs_has_modules`.`modules_id` as `pivot_modules_id`, `demandeurs_has_modules`.`demandeurs_id` as `pivot_demandeurs_id`, `demandeurs_has_modules`.`id` as `pivot_id`, `demandeurs_has_modules`.`deleted_at` as `pivot_deleted_at`, `demandeurs_has_modules`.`created_at` as `pivot_created_at`, `demandeurs_has_modules`.`updated_at` as `pivot_updated_at` from `demandeurs` inner join `demandeurs_has_modules` on `demandeurs`.`id` = `demandeurs_has_modules`.`demandeurs_id` where `demandeurs_has_modules`.`modules_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11) and `demandeurs`.`deleted_at` is null
---
    public function list(Request $request)
    {
        $modules=Module::with('domaine.secteur','demandeurs')->get();