app/Http/Controllers/ProfilesController.php

    public function show(User $user){
        //dd($user);
        //dd($user->profile);

        $recues = \App\Recue::get()->count();
        $internes = \App\Interne::get()->count();
        $departs = \App\Depart::get()->count();
        $courriers = Courrier::latest()->paginate(5);
---
select * from `courriers` where `courriers`.`deleted_at` is null order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `courriers` where `courriers`.`deleted_at` is null